---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.IsCutByInserts
source: html/9196a1c3-00e8-9e4c-42c2-3c0612e9fd71.htm
---
# Autodesk.Revit.DB.WallSweepInfo.IsCutByInserts Property

Indicates if the sweep is cut by wall inserts.

## Syntax (C#)
```csharp
public bool IsCutByInserts { get; set; }
```